* Org Roam to rescue
  Org roam to rescue

  fix issue with org-roam
  #+begin_quote
  byte-code: Cannot open load file: No such file or directory, emacsql-sqlite-common
  #+end_quote

  #+begin_src emacs-lisp
    (use-package org-roam
      :ensure t
      :init
      (setq org-roam-v2-ack t)
      :custom
      (org-roam-directory (file-truename "~/repos/thapakazi/orgr"))
      (org-roam-completion-everywhere t)
      :bind (("C-c n l" . org-roam-buffer-toggle)
             ("C-c n f" . org-roam-node-find)
             ("C-c n g" . org-roam-graph)
             ("C-c n i" . org-roam-node-insert)
             ("C-c n c" . org-roam-capture)
             :map org-mode-map
             ("C-M-i" . completion-at-point)
             ;; Dailies
             ("C-c n j" . org-roam-dailies-capture-today))
      ("C-c n d" . org-roam-dailies-map)
      :config
      (org-roam-db-autosync-mode)
      ;; If using org-roam-protocol
      (require 'org-roam-protocol)
      (org-roam-setup)
      (setq org-roam-dailies-directory "daily/")

      (add-hook 'org-roam-find-file-hook
                (lambda ()
                  (add-hook 'completion-at-point-functions
                            #'org-roam-complete-link-at-point nil t)))
      ;; emacstx meetup, karthink's fix for this [[]] auto completions suggestion
      (setq org-roam-dailies-capture-templates
            '(("d" "default" entry
               "* %?"
               :target (file+head "%<%Y-%m-%d>.org"
                                  "#+title: dailies:%<%Y-%m-%d>\n"))))
    )
  #+end_src

  #+RESULTS:
  : [nil 26976 26960 96375 nil elpaca-process-queues nil nil 0 nil]

***  COMMENT org agenda better ui 
  #+begin_src emacs-lisp
    ;; Function to be run when org-agenda is opened
    (defun org-agenda-open-hook ()
      "Hook to be run when org-agenda is opened"
      (olivetti-mode))

    (use-package olivetti  
      :ensure t
      :config
      ;; Adds hook to org agenda mode, making follow mode active in org agenda
      (add-hook 'org-agenda-mode-hook 'org-agenda-open-hook)
      (setq olivetti-set-width 90)
      )
  #+end_src

  #+RESULTS:
  : [nil 26826 63066 94989 nil elpaca-process-queues nil nil 0 nil]


